# -*- coding: utf-8 -*-
"""Python  "Практика 0.2.0 .ipynb"

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1IwP8cuqsDvQbbKKvlgtQqZeNqJqCQSXx

Напишите свое ФИО: Цепелев Кирилл Сергеевич
"""

print('Привет студентам!')

"""# Основы

Задание 1: Напиши программу, выводящую на экран сообщение "Привет, мир!"
"""

print('Hello World')

"""Задание 2: Напиши программу которая запрашивает имя пользователя и выводит сообщение:

`Привет, <Имя пользователя>`
"""

name = input("Ваше имя: ")
print('Привет,',name)

"""Задание 3: Напиши программу определяющую является ли число четным или нечетным:

Пример:

`Введите число:` 2

`Ваше число четное!`
"""

num = int(input("Введите число: "))
if num%2==0:
    print ("Ваше число чётное!")
else:
    print("Ваше число нечётное!")

"""Задание 4: Напишите программу которая запрашивает длинну и ширину прямоугольника и выводит его площадь:



`Введите длинну прямоугольника:`

`Введите ширину прямоугольника:`

`Площадь прямоугольника: `


"""

print ("Эта программа считает площадь прямоугольника")
dl = int(input("Введите длину прямоугольника: "))
sh = int(input("Введите ширину прямоугольника: "))
if dl > 0 and sh > 0:
    print ("Площадь прямоугольника = ",dl*sh)
else:
    print("Одно из значений равно нулю или отрицательно!")

"""Задание 5: Напишите программу, которая будет вычислять среднее арифметическое введенных чисел"""

numbers = input("Введите числа, разделенные пробелами: ").split()
numbers = [float(num) for num in numbers]

total_sum = 0
for num in numbers:
    total_sum += num

count = len(numbers)

if count > 0:
    average = total_sum / count
    print(f"Среднее арифметическое: {average}")
else:
    print("Числа не были введены.")

"""Задание 6: Напиши программу, которая бы определяла является ли год високосным"""

year = int(input("Введите год: "))
if year == 0:
    print("Такого года не существует!")
else:
    if (year%4==0 ):
        print("Год високосный")
    else:
        print("Год не високосный")

"""Задание 7: Необходимо создать простой калькулятор, который позволяет пользователю выбрать одну из четырёх операций (+, -, *, /), ввести два числа и получить результат выполнения операции."""

a = float(input("Введите первое число: "))
num = (input("Введите оператор (+,-,*,/): "))
b = float(input("Введите второе число: "))

if num == '+':
    print(a+b)
elif num == '-':
    print(a-b)
elif num == '*':
    print(a * b)
elif num == '*':
    print(a * b)
elif num == '/':
    if b == 0:
        print("Деление на ноль невозможно!")
    else:
        print(a / b)
else:
    print("Неверная операция")

"""--------------------------------------------------------------------------------

**Да, задания ниже тоже обязательны, вам необходимо выполнить веееееесь файл**

--------------------------------------------------------------------------------

# Практика 0.2.1

**Шахматы**

Даны стартовые и конечные координаты, а также фигура

Необходимо определить, может ли заданная фигура так ходить?
"""

name = input("Введите название фигуры: ")
if name == 'Ладья':
    x1,y1,x2,y2 = int(input()), int(input()), int(input()), int(input())
    if (x1 - x2) * (y1 - y2) ==0:
        print('Да')
    else:
        print('Нет')
elif name == 'Король':
    x1, y1, x2, y2 = int(input()), int(input()), int(input()), int(input())
    if ((x1 - 1 == x2 and y1 + 1 == y2)
        or (x1 == x2 and y1 + 1 == y2)
        or (x1 + 1 == x2 and y1 + 1 == y2)
        or (x1 + 1 == x2 and y1 == y2)
        or (x1 + 1 == x2 and y1 - 1 == y2)
        or (x1 == x2 and y1 - 1 == y2)
        or (x1 - 1 == x2 and y1 - 1 == y2)
        or (x1 - 1 == x2 and y1 == y2)):
        print('Да')
    else:
        print('Нет')
elif name == 'Слон':
    x1, y1, x2, y2 = int(input()), int(input()), int(input()), int(input())

    if (x1 - y1 == x2 - y2) or (x1 + y1 == x2 + y2):
      print('YES')
    else:
      print('NO')
elif name == 'Ферзь':
    x1, y1, x2, y2 = int(input()), int(input()), int(input()), int(input())

    if (x1 - x2) * (y1 - y2) == 0 or abs(x1 - x2) == abs(y1 - y2):
      print('YES')
    else:
      print('NO')
elif name == 'Конь':
    x1, y1, x2, y2 = int(input()), int(input()), int(input()), int(input())

    if ((x1 - 2 == x2 and y1 + 1 == y2)
      or (x1 - 1 == x2 and y1 + 2 == y2)
      or (x1 + 1 == x2 and y1 + 2 == y2)
      or (x1 + 2 == x2 and y1 + 1 == y2)
      or (x1 + 2 == x2 and y1 - 1 == y2)
      or (x1 + 1 == x2 and y1 - 2 == y2)
      or (x1 - 1 == x2 and y1 - 2 == y2)
      or (x1 - 2 == x2 and y1 - 1 == y2)):
      print('YES')
    else:
      print('NO')

"""# Практика 0.2.2

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции
"""

n = int(input("Введите номер позиции: "))

if n <= 0:
    print("Позиция должна быть положительным числом!")
else:
    current_position = 0
    current_number = 1

    while current_position < n:
        for d in str(current_number):
            current_position += 1
            if current_position == n:
                print(f"Цифра на позиции {n}: {d}")
                break
        current_number += 1

"""# Практика 0.2.3


Возьмите код из задания 7 и улучшите ваш калькулятор следующим образом:

Пользователь вводит строку вида:

(5+5)*5 - данная строка содержит в себе математическое выражение, а также скобки

Ваша программа должная понять что за математическое выражение записано, проверить верно ли оно записано (пример неверного заполнения: (5(+)5)*5, а также расчитать его в соотвествии с правилами математики
"""

